<?xml version="1.0" ?>
<net name="frozen_model" version="10">
	<layers>
		<layer id="0" name="convt3/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="convt2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="convt1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="70" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="resid5_2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="198" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="resid5_1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="454" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="resid4_2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="710" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="resid4_1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="966" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="resid3_2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1222" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="resid3_1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1478" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="resid2_2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1734" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="resid2_1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1990" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="resid1_2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2246" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="resid1_1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2502" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv3/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2758" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv2/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3014" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv1/scale/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3142" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="4,3,512,512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="truediv/reciprocal_2322/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3206" shape="1,1,1,1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="truediv" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MirrorPad/Cast_15003_const" type="Const" version="opset1">
			<data element_type="i64" offset="3208" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="MirrorPad/Cast_25005_const" type="Const" version="opset1">
			<data element_type="i64" offset="3208" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MirrorPad" type="Pad" version="opset1">
			<data pad_mode="reflect" pad_value="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3240" shape="32,3,9,9" size="15552"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="truediv_1/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="18792" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="add_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="18856" shape="64,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv2D_1" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>592</dim>
					<dim>592</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="truediv_2/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="mul_1" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="55720" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="add_3" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv3/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="55848" shape="128,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv2D_2" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>296</dim>
					<dim>296</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="truediv_3/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="mul_2" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv3/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="203304" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="add_5" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="resid1_1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="203560" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv2D_3" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="truediv_4/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="mul_3" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="resid1_1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="498472" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="add_7" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="resid1_2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="498728" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv2D_4" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>146</dim>
					<dim>146</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="truediv_5/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="mul_4" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="resid1_2/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="793640" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="add_9" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Crop_/Cast_15025_const" type="Const" version="opset1">
			<data element_type="i64" offset="793896" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Crop_/Cast_25027_const" type="Const" version="opset1">
			<data element_type="i64" offset="793928" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Crop_/Cast_35029_const" type="Const" version="opset1">
			<data element_type="i64" offset="793960" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Crop_" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,0" ellipsis_mask="0,0,0,0" end_mask="1,1,0,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>148</dim>
					<dim>148</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="add_10" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="resid2_1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="793992" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv2D_5" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="truediv_6/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="mul_5" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="resid2_1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1088904" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="add_12" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="resid2_2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1089160" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv2D_6" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>142</dim>
					<dim>142</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="truediv_7/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="mul_6" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="resid2_2/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="793640" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="add_14" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Crop_4227/Cast_14997_const" type="Const" version="opset1">
			<data element_type="i64" offset="793896" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Crop_4227/Cast_24999_const" type="Const" version="opset1">
			<data element_type="i64" offset="1384072" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Crop_4227/Cast_35001_const" type="Const" version="opset1">
			<data element_type="i64" offset="793960" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Crop_4227" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,0" ellipsis_mask="0,0,0,0" end_mask="1,1,0,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="add_15" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="resid3_1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1384104" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv2D_7" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="truediv_8/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="mul_7" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="resid3_1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1679016" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="add_17" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="resid3_2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1679272" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv2D_8" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>138</dim>
					<dim>138</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="truediv_9/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="mul_8" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="resid3_2/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1974184" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="add_19" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Crop_4243/Cast_15013_const" type="Const" version="opset1">
			<data element_type="i64" offset="793896" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Crop_4243/Cast_25015_const" type="Const" version="opset1">
			<data element_type="i64" offset="1974440" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Crop_4243/Cast_35017_const" type="Const" version="opset1">
			<data element_type="i64" offset="793960" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Crop_4243" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,0" ellipsis_mask="0,0,0,0" end_mask="1,1,0,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>140</dim>
					<dim>140</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="add_20" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="resid4_1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="1974472" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv2D_9" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="truediv_10/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="mul_9" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="resid4_1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2269384" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="add_22" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Relu_6" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="resid4_2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="2269640" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv2D_10" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>134</dim>
					<dim>134</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="truediv_11/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="mul_10" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="resid4_2/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1974184" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="add_24" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Crop_4235/Cast_15019_const" type="Const" version="opset1">
			<data element_type="i64" offset="793896" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Crop_4235/Cast_25021_const" type="Const" version="opset1">
			<data element_type="i64" offset="2564552" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Crop_4235/Cast_35023_const" type="Const" version="opset1">
			<data element_type="i64" offset="793960" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Crop_4235" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,0" ellipsis_mask="0,0,0,0" end_mask="1,1,0,0" new_axis_mask="0,0,0,0" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>136</dim>
					<dim>136</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="add_25" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="resid5_1/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="2564584" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv2D_11" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>132</dim>
					<dim>132</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="truediv_12/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="mul_11" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="resid5_1/shift/read/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2859496" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="add_27" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="resid5_2/weight/read/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="2859752" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv2D_12" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>130</dim>
					<dim>130</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="truediv_13/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="0.001" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="mul_12" type="Multiply" version="opset1">
			<input>
				<port id="0">
